hiteshrai/redurchin/thirdparty/Kinetis-SDK/boards/frdmkl27z/demo_apps/adc16_low_power_peripheral/peripherals.h
/*
 * The Clear BSD License
 * Copyright 2018 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 * that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PERIPHERALS_H_
#define _PERIPHERALS_H_

/***********************************************************************************************************************
 * Included files
 **********************************************************************************************************************/
#include "fsl_common.h"
#include "fsl_lptmr.h"
#include "fsl_gpio.h"
#include "fsl_port.h"
#include "fsl_adc16.h"

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/***********************************************************************************************************************
 * Definitions
 **********************************************************************************************************************/
/* Definitions for BOARD_InitPeripherals functional group */
/* BOARD_InitPeripherals defines for LPTMR0 */
/* Definition of peripheral ID */
#define DEMO_LPTMR_PERIPHERAL LPTMR0
/* Definition of the clock source frequency */
#define DEMO_LPTMR_CLK_FREQ 1000UL
/* Definition of the prescaled clock source frequency */
#define DEMO_LPTMR_INPUT_FREQ 500UL
/* Definition of the timer period in us */
#define DEMO_LPTMR_USEC_COUNT 1000000UL
/* LPTMR interrupt vector ID (number). */
#define DEMO_LPTMR_IRQN LPTMR0_IRQn
/* LPTMR interrupt handler identifier. */
#define DEMO_LPTMR_IRQHANDLER LPTMR0_IRQHandler
/* Alias for GPIOA peripheral */
#define DEMO_LEDRGB_BLUE_GPIO GPIOA
/* Alias for GPIOB peripheral */
#define DEMO_LEDRGB_RED_GREEN_GPIO GPIOB

/* Definitions for BOARD_InitADCPeripheral functional group */
/* Alias for ADC0 peripheral */
#define DEMO_ADC16_PERIPHERAL ADC0
/* ADC16 interrupt vector ID (number). */
#define DEMO_ADC16_IRQN ADC0_IRQn
/* ADC16 interrupt handler identifier. */
#define DEMO_ADC16_IRQHANDLER ADC0_IRQHandler

/***********************************************************************************************************************
 * Global variables
 **********************************************************************************************************************/
extern const lptmr_config_t DEMO_LPTMR_config;
extern adc16_channel_config_t DEMO_ADC16_channelsConfig[2];
extern const adc16_config_t DEMO_ADC16_config;
extern const adc16_channel_mux_mode_t DEMO_ADC16_muxMode;
extern const adc16_hardware_average_mode_t DEMO_ADC16_hardwareAverageMode;

/***********************************************************************************************************************
 * Initialization functions
 **********************************************************************************************************************/
void BOARD_InitPeripherals(void);
void BOARD_InitADCPeripheral(void);

/***********************************************************************************************************************
 * BOARD_InitBootPeripherals function
 **********************************************************************************************************************/
void BOARD_InitBootPeripherals(void);

#if defined(__cplusplus)
}
#endif

#endif /* _PERIPHERALS_H_ */
